burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau.c
/*!
    \file    gd32w51x_f5hc_cau.c
    \brief   CAU driver
    
    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32w51x_f5hc_cau.h"
#include "gd32w51x_f5hc_rcu.h"


/*!
    \brief      reset the CAU peripheral (API_ID(0x0001U))
    \param[in]  none     
    \param[out] none
    \retval     none
*/
void cau_deinit(void)
{
    /* enable CAU reset state */
    rcu_periph_reset_enable(RCU_CAURST);
    /* release CAU from reset state */
    rcu_periph_reset_disable(RCU_CAURST);
}

/*!
    \brief      initialize the CAU encrypt and decrypt parameter struct with the default values (API_ID(0x0002U))
    \param[in]  none
    \param[out] cau_parameter:
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT
                  key: key
                  key_size: key size in bytes
                  iv: initialization vector
                  iv_size: iv size in bytes
                  input: input data
                  in_length: input data length in bytes
                  aad: additional authentication data 
                  aad_size: aad size
    \retval     none
*/
void cau_struct_para_init(cau_parameter_struct *cau_parameter)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the CAU encrypt and decrypt parameters struct with the default values */
        cau_parameter->alg_dir      = CAU_ENCRYPT;
        cau_parameter->key          = 0U;
        cau_parameter->key_size     = 0U;
        cau_parameter->iv           = 0U;
        cau_parameter->iv_size      = 0U;
        cau_parameter->input        = 0U;
        cau_parameter->in_length    = 0U;
        cau_parameter->aad       = 0U;
        cau_parameter->aad_size  = 0U;      
    }
} 

/*!
    \brief      initialize the key parameter struct with the default values (API_ID(0x0003U))
    \param[in]  none
    \param[out] key_initpara:
                  key_0_high: key 0 high
                  key_0_low: key 0 low
                  key_1_high: key 1 high
                  key_1_low: key 1 low
                  key_2_high: key 2 high
                  key_2_low: key 2 low
                  key_3_high: key 3 high
                  key_3_low: key 3 low
    \retval     none
*/
void cau_key_struct_para_init(cau_key_parameter_struct *key_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(key_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the key parameters struct with the default values */
        key_initpara->key_0_high   = 0U;
        key_initpara->key_0_low    = 0U;
        key_initpara->key_1_high   = 0U;
        key_initpara->key_1_low    = 0U;
        key_initpara->key_2_high   = 0U;
        key_initpara->key_2_low    = 0U;
        key_initpara->key_3_high   = 0U;
        key_initpara->key_3_low    = 0U; 
    }
}   

/*!
    \brief      initialize the vectors parameter struct with the default values (API_ID(0x0004U))
    \param[in]  none
    \param[out] iv_initpara:
                  iv_0_high: init vector 0 high
                  iv_0_low: init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low: init vector 1 low
    \retval     none
*/
void cau_iv_struct_para_init(cau_iv_parameter_struct *iv_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(iv_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0004U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the vectors parameters struct with the default values */
        iv_initpara->iv_0_high   = 0U;
        iv_initpara->iv_0_low    = 0U;
        iv_initpara->iv_1_high   = 0U;
        iv_initpara->iv_1_low    = 0U;
    }
} 

/*!
    \brief      initialize the context parameter struct with the default values (API_ID(0x0005U))
    \param[in]  none
    \param[out] cau_context:
                  ctl_config: current configuration
                  iv_0_high: init vector 0 high
                  iv_0_low:  init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low:  init vector 1 low
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
                  gcmccmctxs[8]: GCM or CCM mode context switch
                  gcmctxs[8]: GCM mode context switch
    \retval     none
*/
void cau_context_struct_para_init(cau_context_parameter_struct *cau_context)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_context)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0005U), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_context->ctl_config = 0U;

        /* set the vectors parameters with the default values */    
        cau_context->iv_0_high  = 0U;
        cau_context->iv_0_low   = 0U;
        cau_context->iv_1_high  = 0U;
        cau_context->iv_1_low   = 0U; 

