burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau.c
        /* save the key value */
        cau_context->key_0_high = key_initpara->key_0_high;
        cau_context->key_0_low  = key_initpara->key_0_low;  
        cau_context->key_1_high = key_initpara->key_1_high;
        cau_context->key_1_low  = key_initpara->key_1_low;  
        cau_context->key_2_high = key_initpara->key_2_high;
        cau_context->key_2_low  = key_initpara->key_2_low;  
        cau_context->key_3_high = key_initpara->key_3_high;
        cau_context->key_3_low  = key_initpara->key_3_low;    
        
        if((CAU_MODE_TDES_ECB != algm_reg) && (CAU_MODE_DES_ECB != algm_reg) && (CAU_MODE_AES_ECB != algm_reg)){
        /* if not in ECB mode, save the initialization vectors */
        cau_context->iv_0_high = CAU_IV0H;
        cau_context->iv_0_low = CAU_IV0L;
        cau_context->iv_1_high = CAU_IV1H;
        cau_context->iv_1_low = CAU_IV1L;    
        }

        /* if in GCM/CCM mode, save the context switch registers */
        if((CAU_MODE_AES_GCM == algm_reg) || (CAU_MODE_AES_CCM == algm_reg)){
            cau_context->gcmccmctxs[0U] = CAU_GCMCCMCTXSx(0U);
            cau_context->gcmccmctxs[1U] = CAU_GCMCCMCTXSx(1U);
            cau_context->gcmccmctxs[2U] = CAU_GCMCCMCTXSx(2U);
            cau_context->gcmccmctxs[3U] = CAU_GCMCCMCTXSx(3U);
            cau_context->gcmccmctxs[4U] = CAU_GCMCCMCTXSx(4U);
            cau_context->gcmccmctxs[5U] = CAU_GCMCCMCTXSx(5U);
            cau_context->gcmccmctxs[6U] = CAU_GCMCCMCTXSx(6U);
            cau_context->gcmccmctxs[7U] = CAU_GCMCCMCTXSx(7U); 
        }

        /* if in GCM mode, save the context switch registers */
        if(CAU_MODE_AES_GCM == algm_reg){
            cau_context->gcmctxs[0U] = CAU_GCMCTXSx(0U); 
            cau_context->gcmctxs[1U] = CAU_GCMCTXSx(1U); 
            cau_context->gcmctxs[2U] = CAU_GCMCTXSx(2U); 
            cau_context->gcmctxs[3U] = CAU_GCMCTXSx(3U); 
            cau_context->gcmctxs[4U] = CAU_GCMCTXSx(4U); 
            cau_context->gcmctxs[5U] = CAU_GCMCTXSx(5U); 
            cau_context->gcmctxs[6U] = CAU_GCMCTXSx(6U); 
            cau_context->gcmctxs[7U] = CAU_GCMCTXSx(7U);    
        }
    }
} 

/*!
    \brief      restore context after context switching (API_ID(0x0014U))
    \param[in]  cau_context:
                  ctl_config: current configuration
                  iv_0_high: init vector 0 high
                  iv_0_low:  init vector 0 low
                  iv_1_high: init vector 1 high
                  iv_1_low:  init vector 1 low
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
                  gcmccmctxs[8]: GCM or CCM mode context switch
                  gcmctxs[8]: GCM mode context switch
    \param[out] none
    \retval     none
*/
void cau_context_restore(cau_context_parameter_struct *cau_context)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_context)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t algm_reg, aes_decrypt;
        
        /* configure the processor with the saved configuration */
        CAU_CTL = cau_context->ctl_config;

        algm_reg = CAU_CTL & CAU_CTL_ALGM;
        
        /* restore the key value */
        CAU_KEY0H = cau_context->key_0_high; 
        CAU_KEY0L = cau_context->key_0_low ;
        CAU_KEY1H = cau_context->key_1_high;
        CAU_KEY1L = cau_context->key_1_low ;
        CAU_KEY2H = cau_context->key_2_high;
        CAU_KEY2L = cau_context->key_2_low ;
        CAU_KEY3H = cau_context->key_3_high;
        CAU_KEY3L = cau_context->key_3_low ;

        if((CAU_MODE_TDES_ECB != algm_reg) && (CAU_MODE_DES_ECB != algm_reg) && (CAU_MODE_AES_ECB != algm_reg)){    
            /* restore the initialization vectors */
            CAU_IV0H = cau_context->iv_0_high;
            CAU_IV0L = cau_context->iv_0_low ;
            CAU_IV1H = cau_context->iv_1_high;
            CAU_IV1L = cau_context->iv_1_low ;
        }
        
        /* if in GCM/CCM mode, restore the context switch registers */
        if((CAU_MODE_AES_GCM == algm_reg) || (CAU_MODE_AES_CCM == algm_reg)){    
            CAU_GCMCCMCTXSx(0U) = cau_context->gcmccmctxs[0U];
            CAU_GCMCCMCTXSx(1U) = cau_context->gcmccmctxs[1U];
            CAU_GCMCCMCTXSx(2U) = cau_context->gcmccmctxs[2U];
            CAU_GCMCCMCTXSx(3U) = cau_context->gcmccmctxs[3U];
            CAU_GCMCCMCTXSx(4U) = cau_context->gcmccmctxs[4U];
            CAU_GCMCCMCTXSx(5U) = cau_context->gcmccmctxs[5U];
            CAU_GCMCCMCTXSx(6U) = cau_context->gcmccmctxs[6U];
            CAU_GCMCCMCTXSx(7U) = cau_context->gcmccmctxs[7U];
        }

        /* if in GCM mode, restore the context switch registers */
        if(CAU_MODE_AES_GCM == algm_reg){    
            CAU_GCMCTXSx(0U) = cau_context->gcmctxs[0U];
            CAU_GCMCTXSx(1U) = cau_context->gcmctxs[1U];
            CAU_GCMCTXSx(2U) = cau_context->gcmctxs[2U];
            CAU_GCMCTXSx(3U) = cau_context->gcmctxs[3U];
            CAU_GCMCTXSx(4U) = cau_context->gcmctxs[4U];
            CAU_GCMCTXSx(5U) = cau_context->gcmctxs[5U];
            CAU_GCMCTXSx(6U) = cau_context->gcmctxs[6U];
            CAU_GCMCTXSx(7U) = cau_context->gcmctxs[7U];
        }
        
        /* if it is AES ECB/CBC decryption, then first prepare key */
        aes_decrypt = CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR);
        if(((CAU_MODE_AES_ECB | CAU_DECRYPT) == aes_decrypt) || ((CAU_MODE_AES_CBC | CAU_DECRYPT) == aes_decrypt)){
            uint32_t alg_dir, algo_mode, swapping;
            
            /* flush IN/OUT FIFOs */
            cau_fifo_flush();
            /* parameters for key preparation for AES decryption */
            alg_dir = CAU_DECRYPT;
            algo_mode = CAU_MODE_AES_KEY;
            swapping = CAU_SWAPPING_32BIT;
            cau_init(alg_dir, algo_mode, swapping);

            /* enable CAU */
            cau_enable();

            /* wait until BUSY=0 */
            while((uint32_t)0U != cau_flag_get(CAU_FLAG_BUSY)){
            }

            /* parameters for decryption */  
            CAU_CTL = cau_context->ctl_config;
        }

        /* enable CAU */
        cau_enable();
    }
}

/*!
    \brief      enable the CAU interrupts (API_ID(0x0015U))
    \param[in]  interrupt: specify the CAU interrupt source to be enabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_INT_INFIFO: input FIFO interrupt 
      \arg        CAU_INT_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     none
*/
void cau_interrupt_enable(uint32_t interrupt)
{
    /* enable the selected CAU interrupt */
    CAU_INTEN |= interrupt; 
}

/*!
    \brief      disable the CAU interrupts (API_ID(0x0016U))
    \param[in]  interrupt: specify the CAU interrupt source to be disabled
                one or more parameters can be selected which are shown as below:
      \arg        CAU_INT_INFIFO: input FIFO interrupt 
      \arg        CAU_INT_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     none
*/
void cau_interrupt_disable(uint32_t interrupt)
{
    /* disable the selected CAU interrupt */
    CAU_INTEN &= ~(interrupt);
}

/*!
    \brief      get the interrupt flag (API_ID(0x0017U))
    \param[in]  interrupt: CAU interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        CAU_INT_FLAG_INFIFO: input FIFO interrupt 
      \arg        CAU_INT_FLAG_OUTFIFO: output FIFO interrupt
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cau_interrupt_flag_get(uint32_t interrupt)
{
    FlagStatus flag = RESET;
  
    /* check the status of the specified CAU interrupt */
    if(RESET != (CAU_INTF & interrupt)){
        flag = SET;
    }
    
    return flag;
}

/*!
    \brief      get the CAU flag status (API_ID(0x0018U))
    \param[in]  flag: CAU flag status
                only one parameter can be selected which is shown as below:
      \arg        CAU_FLAG_INFIFO_EMPTY: input FIFO empty 
      \arg        CAU_FLAG_INFIFO_NO_FULL: input FIFO is not full
      \arg        CAU_FLAG_OUTFIFO_NO_EMPTY: output FIFO not empty 
      \arg        CAU_FLAG_OUTFIFO_FULL: output FIFO is full
      \arg        CAU_FLAG_BUSY: the CAU core is busy 
      \arg        CAU_FLAG_INFIFO: input FIFO flag status
      \arg        CAU_FLAG_OUTFIFO: output FIFO flag status      
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus cau_flag_get(uint32_t flag)
{
    uint32_t reg = 0U;
    FlagStatus ret_flag = RESET;

    /* check if the flag is in CAU_STAT1 register */
    if(1U == (flag >> 31U)){ 
        reg = CAU_STAT1;
    }else{
        /* the flag is in CAU_STAT0 register */
        reg = CAU_STAT0;
    }

    /* check the status of the specified CAU flag */
    if(0U != (reg & flag)){
        ret_flag = SET;
    }
     
    return ret_flag;
}
